app/views/proyectos/misdonantes.html.erb


    <%  proy = Userproject.where("proyecto_id=?",proyecto.id) %>
---
SELECT usuario_id,proyecto_id,sum(monto) as monto_t FROM "userprojects" WHERE (usuario_id='3') GROUP BY proyecto_id

        <tr>
        <%  usr = Usuario.find(userproject.usuario_id) %>
---
SELECT "usuarios".* FROM "usuarios" WHERE "usuarios"."id" = ? LIMIT 1  [["id", 5]]