app/views/userprojects/misproyectos.html.erb


                    <% prj = Userproject.where("usuario_id=? AND proyecto_id=?",userproject.usuario_id,proy_id).sum(:monto)%>
                    <%  proy = Proyecto.find(userproject.proyecto_id) %>
---
SELECT SUM("userprojects"."monto") AS sum_id FROM "userprojects" WHERE (usuario_id=6 AND proyecto_id=3)
SELECT usuario_id,proyecto_id,sum(monto) as monto_t FROM "userprojects" WHERE (usuario_id='5') GROUP BY proyecto_id
SELECT "proyectos".* FROM "proyectos" WHERE "proyectos"."id" = ? LIMIT 1  [["id", 3]]