app/controllers/home_controller.rb

SELECT "proyectos".* FROM "proyectos" ORDER BY created_at DESC
---
  def inicio
  	 @proyectos = Proyecto.order("created_at DESC")