app/controllers/home_controller.rb

  def index
  	 @proyectos = Proyecto.order("created_at DESC")
---
SELECT "proyectos".* FROM "proyectos" ORDER BY created_at DESC