app/controllers/proyectos_controller.rb

SELECT "proyectos".* FROM "proyectos"
---
  def index
    @proyectos = Proyecto.all

SELECT "proyectos".* FROM "proyectos" WHERE "proyectos"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @proyecto = Proyecto.find(params[:id])

SELECT "proyectos".* FROM "proyectos" WHERE "proyectos"."id" = ? LIMIT 1  [["id", "3"]]
---
  def edit
    @proyecto = Proyecto.find(params[:id])

INSERT INTO "proyectos" ("created_at", "descripcion", "fecha_cierre", "fecha_inicio", "fecha_limite", "monto_actual", "monto_total", "nombre", "status", "updated_at", "usuario_id", "visible") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @proyecto = Proyecto.new(params[:proyecto])

    respond_to do |format|
      if @proyecto.save

SELECT "proyectos".* FROM "proyectos" WHERE "proyectos"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "proyectos" SET "monto_total" = 1000.0, "updated_at" = '2013-05-29 12:00:39.315518' WHERE "proyectos"."id" = 1
---
  def update
    @proyecto = Proyecto.find(params[:id])

    respond_to do |format|
      if @proyecto.update_attributes(params[:proyecto])

SELECT "proyectos".* FROM "proyectos" WHERE (usuario_id=NULL)
---
  def misproyectos
    @proyectos = Proyecto.where("usuario_id=?",params[:id])

SELECT "proyectos".* FROM "proyectos" WHERE "proyectos"."id" = ? LIMIT 1  [["id", 3]]
---
  def misdonantes
    @proyectos = Proyecto.where("usuario_id=?",params[:id])