app/controllers/userprojects_controller.rb

  def index
    @userprojects = Userproject.all
---
SELECT "userprojects".* FROM "userprojects"

  def index_proyecto
    @proyectos = Proyecto.all
---
SELECT "proyectos".* FROM "proyectos"

  def show
    @userproject = Userproject.find(params[:id])
---
SELECT "userprojects".* FROM "userprojects" WHERE "userprojects"."id" = ? LIMIT 1  [["id", "index_proyecto"]]

  def create
    @userproject = Userproject.new(params[:userproject])

    respond_to do |format|
      if @userproject.save
        prj = Proyecto.find(@userproject.proyecto_id)

        asco = prj.monto_actual + @userproject.monto
        Proyecto.update(@userproject.proyecto_id , :monto_actual => asco) ##actualizo monto_Actual
---
INSERT INTO "userprojects" ("created_at", "fecha_monto", "monto", "proyecto_id", "updated_at", "usuario_id") VALUES (?, ?, ?, ?, ?, ?)
SELECT "proyectos".* FROM "proyectos" WHERE "proyectos"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "proyectos" SET "status" = 0, "fecha_cierre" = '2013-05-28 05:35:25.000000', "updated_at" = '2013-05-28 05:35:25.164261' WHERE "proyectos"."id" = 1

  def misproyectos
    @userproject = Userproject.where("usuario_id=?",params[:id])
    @asdf = Userproject.select("usuario_id,proyecto_id,sum(monto) as monto_t").where("usuario_id=?",params[:id]).group("proyecto_id")
---
SELECT usuario_id,proyecto_id,sum(monto) as monto_t FROM "userprojects" WHERE (usuario_id='5') GROUP BY proyecto_id
SELECT SUM("userprojects"."monto") AS sum_id FROM "userprojects" WHERE (usuario_id=6 AND proyecto_id=3)