app/controllers/userprojects_controller.rb

SELECT "proyectos".* FROM "proyectos" WHERE (usuario_id='6')
---
  def misproyectos
    @userproject = Userproject.where("usuario_id=?",params[:id])
    @proyectos = Proyecto.all