app/controllers/usuarios_controller.rb

  def show
    @usuario = Usuario.find(params[:id])
---
SELECT "usuarios".* FROM "usuarios" WHERE "usuarios"."id" = ? LIMIT 1  [["id", "1"]]

  def edit
    @usuario = Usuario.find(params[:id])
---
SELECT "usuarios".* FROM "usuarios" WHERE "usuarios"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @usuario = Usuario.new(params[:usuario])


        respond_to do |format|
          if @usuario.save
---
INSERT INTO "usuarios" ("apellido", "created_at", "crypted_password", "email", "fecha_registro", "nombre", "salt", "telefono", "tipo_usuario", "updated_at", "username") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @usuario = Usuario.find(params[:id])

    respond_to do |format|
      if @usuario.update_attributes(params[:usuario])
---
SELECT "usuarios".* FROM "usuarios" WHERE "usuarios"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "usuarios" SET "nombre" = 'josue Carlos', "apellido" = 'morales ramirez', "telefono" = 1234567890, "salt" = 'FxZjXzXpyCDTpuMyzV6z', "crypted_password" = '$2a$10$pJgMmTFPGDPTYM8DieeOXumDIxK2rsAl7ICpKZPwWvRBvOVjCAtY.', "updated_at" = '2013-05-29 04:35:29.189786' WHERE "usuarios"."id" = 5

  def destroy
    @usuario = Usuario.find(params[:id])
    @usuario.destroy
---
SELECT "usuarios".* FROM "usuarios" WHERE "usuarios"."id" = ? LIMIT 1  [["id", "5"]]
DELETE FROM "usuarios" WHERE "usuarios"."id" = ?  [["id", 5]]